Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/spi_ixs.h
/*
 * Component description for SPI_IXS
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-11-16T06:44:02Z */
#ifndef _PIC32CKSG01_SPI_IXS_COMPONENT_H_
#define _PIC32CKSG01_SPI_IXS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SPI_IXS                                      */
/* ************************************************************************** */

/* -------- SPI_IXS_CTRLA : (SPI_IXS Offset: 0x00) (R/W 32) SPI Control Enable Register -------- */
#define SPI_IXS_CTRLA_RESETVALUE              _UINT32_(0x00)                                       /*  (SPI_IXS_CTRLA) SPI Control Enable Register  Reset Value */

#define SPI_IXS_CTRLA_SWRST_Pos               _UINT32_(0)                                          /* (SPI_IXS_CTRLA) SPI Software Reset Position */
#define SPI_IXS_CTRLA_SWRST_Msk               (_UINT32_(0x1) << SPI_IXS_CTRLA_SWRST_Pos)           /* (SPI_IXS_CTRLA) SPI Software Reset Mask */
#define SPI_IXS_CTRLA_SWRST(value)            (SPI_IXS_CTRLA_SWRST_Msk & (_UINT32_(value) << SPI_IXS_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the SPI_IXS_CTRLA register */
#define SPI_IXS_CTRLA_ENABLE_Pos              _UINT32_(1)                                          /* (SPI_IXS_CTRLA) SPI Enable (ON) bit Position */
#define SPI_IXS_CTRLA_ENABLE_Msk              (_UINT32_(0x1) << SPI_IXS_CTRLA_ENABLE_Pos)          /* (SPI_IXS_CTRLA) SPI Enable (ON) bit Mask */
#define SPI_IXS_CTRLA_ENABLE(value)           (SPI_IXS_CTRLA_ENABLE_Msk & (_UINT32_(value) << SPI_IXS_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the SPI_IXS_CTRLA register */
#define SPI_IXS_CTRLA_RUNSTDBY_Pos            _UINT32_(6)                                          /* (SPI_IXS_CTRLA) RUN STANDBY Mode Enable bit Position */
#define SPI_IXS_CTRLA_RUNSTDBY_Msk            (_UINT32_(0x1) << SPI_IXS_CTRLA_RUNSTDBY_Pos)        /* (SPI_IXS_CTRLA) RUN STANDBY Mode Enable bit Mask */
#define SPI_IXS_CTRLA_RUNSTDBY(value)         (SPI_IXS_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << SPI_IXS_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the SPI_IXS_CTRLA register */
#define SPI_IXS_CTRLA_Msk                     _UINT32_(0x00000043)                                 /* (SPI_IXS_CTRLA) Register Mask  */


/* -------- SPI_IXS_SELCTRL : (SPI_IXS Offset: 0x04) (R/W 32) SPI Control Options Select Register -------- */
#define SPI_IXS_SELCTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_SELCTRL) SPI Control Options Select Register  Reset Value */

#define SPI_IXS_SELCTRL_CLKINDLY_Pos          _UINT32_(0)                                          /* (SPI_IXS_SELCTRL) Serial Clock Input Delay for SDI sampling Position */
#define SPI_IXS_SELCTRL_CLKINDLY_Msk          (_UINT32_(0x3) << SPI_IXS_SELCTRL_CLKINDLY_Pos)      /* (SPI_IXS_SELCTRL) Serial Clock Input Delay for SDI sampling Mask */
#define SPI_IXS_SELCTRL_CLKINDLY(value)       (SPI_IXS_SELCTRL_CLKINDLY_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_CLKINDLY_Pos)) /* Assigment of value for CLKINDLY in the SPI_IXS_SELCTRL register */
#define   SPI_IXS_SELCTRL_CLKINDLY_TDLY0_Val  _UINT32_(0x0)                                        /* (SPI_IXS_SELCTRL) 0 Tap Delays  */
#define   SPI_IXS_SELCTRL_CLKINDLY_TDLY1_Val  _UINT32_(0x1)                                        /* (SPI_IXS_SELCTRL) 1 Tap Delay  */
#define   SPI_IXS_SELCTRL_CLKINDLY_TDLY2_Val  _UINT32_(0x2)                                        /* (SPI_IXS_SELCTRL) 2 Tap Delay  */
#define   SPI_IXS_SELCTRL_CLKINDLY_TDLY3_Val  _UINT32_(0x3)                                        /* (SPI_IXS_SELCTRL) 3 Tap Delay  */
#define SPI_IXS_SELCTRL_CLKINDLY_TDLY0        (SPI_IXS_SELCTRL_CLKINDLY_TDLY0_Val << SPI_IXS_SELCTRL_CLKINDLY_Pos) /* (SPI_IXS_SELCTRL) 0 Tap Delays Position  */
#define SPI_IXS_SELCTRL_CLKINDLY_TDLY1        (SPI_IXS_SELCTRL_CLKINDLY_TDLY1_Val << SPI_IXS_SELCTRL_CLKINDLY_Pos) /* (SPI_IXS_SELCTRL) 1 Tap Delay Position  */
#define SPI_IXS_SELCTRL_CLKINDLY_TDLY2        (SPI_IXS_SELCTRL_CLKINDLY_TDLY2_Val << SPI_IXS_SELCTRL_CLKINDLY_Pos) /* (SPI_IXS_SELCTRL) 2 Tap Delay Position  */
#define SPI_IXS_SELCTRL_CLKINDLY_TDLY3        (SPI_IXS_SELCTRL_CLKINDLY_TDLY3_Val << SPI_IXS_SELCTRL_CLKINDLY_Pos) /* (SPI_IXS_SELCTRL) 3 Tap Delay Position  */
#define SPI_IXS_SELCTRL_SRXISEL_Pos           _UINT32_(4)                                          /* (SPI_IXS_SELCTRL) SPI Receive Service Request Interrupt Select Position */
#define SPI_IXS_SELCTRL_SRXISEL_Msk           (_UINT32_(0x3) << SPI_IXS_SELCTRL_SRXISEL_Pos)       /* (SPI_IXS_SELCTRL) SPI Receive Service Request Interrupt Select Mask */
#define SPI_IXS_SELCTRL_SRXISEL(value)        (SPI_IXS_SELCTRL_SRXISEL_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_SRXISEL_Pos)) /* Assigment of value for SRXISEL in the SPI_IXS_SELCTRL register */
#define   SPI_IXS_SELCTRL_SRXISEL_RXBEMPTY_Val _UINT32_(0x0)                                        /* (SPI_IXS_SELCTRL) RXB Empty  */
#define   SPI_IXS_SELCTRL_SRXISEL_RXBNEMPTY_Val _UINT32_(0x1)                                        /* (SPI_IXS_SELCTRL) RXB Not Empty  */
#define   SPI_IXS_SELCTRL_SRXISEL_RXBHFULL_Val _UINT32_(0x2)                                        /* (SPI_IXS_SELCTRL) RXB Half Full  */
#define   SPI_IXS_SELCTRL_SRXISEL_RXBFULL_Val _UINT32_(0x3)                                        /* (SPI_IXS_SELCTRL) RXB Full  */
#define SPI_IXS_SELCTRL_SRXISEL_RXBEMPTY      (SPI_IXS_SELCTRL_SRXISEL_RXBEMPTY_Val << SPI_IXS_SELCTRL_SRXISEL_Pos) /* (SPI_IXS_SELCTRL) RXB Empty Position  */
#define SPI_IXS_SELCTRL_SRXISEL_RXBNEMPTY     (SPI_IXS_SELCTRL_SRXISEL_RXBNEMPTY_Val << SPI_IXS_SELCTRL_SRXISEL_Pos) /* (SPI_IXS_SELCTRL) RXB Not Empty Position  */
#define SPI_IXS_SELCTRL_SRXISEL_RXBHFULL      (SPI_IXS_SELCTRL_SRXISEL_RXBHFULL_Val << SPI_IXS_SELCTRL_SRXISEL_Pos) /* (SPI_IXS_SELCTRL) RXB Half Full Position  */
#define SPI_IXS_SELCTRL_SRXISEL_RXBFULL       (SPI_IXS_SELCTRL_SRXISEL_RXBFULL_Val << SPI_IXS_SELCTRL_SRXISEL_Pos) /* (SPI_IXS_SELCTRL) RXB Full Position  */
#define SPI_IXS_SELCTRL_IGNROV_Pos            _UINT32_(6)                                          /* (SPI_IXS_SELCTRL) Ignore Receive Overflow (for Audio Data Transmissions) Position */
#define SPI_IXS_SELCTRL_IGNROV_Msk            (_UINT32_(0x1) << SPI_IXS_SELCTRL_IGNROV_Pos)        /* (SPI_IXS_SELCTRL) Ignore Receive Overflow (for Audio Data Transmissions) Mask */
#define SPI_IXS_SELCTRL_IGNROV(value)         (SPI_IXS_SELCTRL_IGNROV_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_IGNROV_Pos)) /* Assigment of value for IGNROV in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_CPHA_Pos              _UINT32_(10)                                         /* (SPI_IXS_SELCTRL) SPI Clock Edge Select bit Position */
#define SPI_IXS_SELCTRL_CPHA_Msk              (_UINT32_(0x1) << SPI_IXS_SELCTRL_CPHA_Pos)          /* (SPI_IXS_SELCTRL) SPI Clock Edge Select bit Mask */
#define SPI_IXS_SELCTRL_CPHA(value)           (SPI_IXS_SELCTRL_CPHA_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_CPHA_Pos)) /* Assigment of value for CPHA in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_CPOL_Pos              _UINT32_(11)                                         /* (SPI_IXS_SELCTRL) Clock Polarity Select bit Position */
#define SPI_IXS_SELCTRL_CPOL_Msk              (_UINT32_(0x1) << SPI_IXS_SELCTRL_CPOL_Pos)          /* (SPI_IXS_SELCTRL) Clock Polarity Select bit Mask */
#define SPI_IXS_SELCTRL_CPOL(value)           (SPI_IXS_SELCTRL_CPOL_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_CPOL_Pos)) /* Assigment of value for CPOL in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_STXISEL_Pos           _UINT32_(12)                                         /* (SPI_IXS_SELCTRL) SPI Transmit Service Request Interrupt Select Position */
#define SPI_IXS_SELCTRL_STXISEL_Msk           (_UINT32_(0x3) << SPI_IXS_SELCTRL_STXISEL_Pos)       /* (SPI_IXS_SELCTRL) SPI Transmit Service Request Interrupt Select Mask */
#define SPI_IXS_SELCTRL_STXISEL(value)        (SPI_IXS_SELCTRL_STXISEL_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_STXISEL_Pos)) /* Assigment of value for STXISEL in the SPI_IXS_SELCTRL register */
#define   SPI_IXS_SELCTRL_STXISEL_TXBSREMPTY_Val _UINT32_(0x0)                                        /* (SPI_IXS_SELCTRL) TXB And SR Empty  */
#define   SPI_IXS_SELCTRL_STXISEL_TXBEMPTY_Val _UINT32_(0x1)                                        /* (SPI_IXS_SELCTRL) TXB Empty  */
#define   SPI_IXS_SELCTRL_STXISEL_TXBHEMPTY_Val _UINT32_(0x2)                                        /* (SPI_IXS_SELCTRL) TXB Half Empty  */
#define   SPI_IXS_SELCTRL_STXISEL_TXBNFULL_Val _UINT32_(0x3)                                        /* (SPI_IXS_SELCTRL) TXB Not Full  */
#define SPI_IXS_SELCTRL_STXISEL_TXBSREMPTY    (SPI_IXS_SELCTRL_STXISEL_TXBSREMPTY_Val << SPI_IXS_SELCTRL_STXISEL_Pos) /* (SPI_IXS_SELCTRL) TXB And SR Empty Position  */
#define SPI_IXS_SELCTRL_STXISEL_TXBEMPTY      (SPI_IXS_SELCTRL_STXISEL_TXBEMPTY_Val << SPI_IXS_SELCTRL_STXISEL_Pos) /* (SPI_IXS_SELCTRL) TXB Empty Position  */
#define SPI_IXS_SELCTRL_STXISEL_TXBHEMPTY     (SPI_IXS_SELCTRL_STXISEL_TXBHEMPTY_Val << SPI_IXS_SELCTRL_STXISEL_Pos) /* (SPI_IXS_SELCTRL) TXB Half Empty Position  */
#define SPI_IXS_SELCTRL_STXISEL_TXBNFULL      (SPI_IXS_SELCTRL_STXISEL_TXBNFULL_Val << SPI_IXS_SELCTRL_STXISEL_Pos) /* (SPI_IXS_SELCTRL) TXB Not Full Position  */
#define SPI_IXS_SELCTRL_IGNTUR_Pos            _UINT32_(14)                                         /* (SPI_IXS_SELCTRL) Ignore Transmit Underrun (for Audio Data Transmissions) Position */
#define SPI_IXS_SELCTRL_IGNTUR_Msk            (_UINT32_(0x1) << SPI_IXS_SELCTRL_IGNTUR_Pos)        /* (SPI_IXS_SELCTRL) Ignore Transmit Underrun (for Audio Data Transmissions) Mask */
#define SPI_IXS_SELCTRL_IGNTUR(value)         (SPI_IXS_SELCTRL_IGNTUR_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_IGNTUR_Pos)) /* Assigment of value for IGNTUR in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_DATFMTLR_Pos          _UINT32_(16)                                         /* (SPI_IXS_SELCTRL) Packed data format -- left or right justified Position */
#define SPI_IXS_SELCTRL_DATFMTLR_Msk          (_UINT32_(0x1) << SPI_IXS_SELCTRL_DATFMTLR_Pos)      /* (SPI_IXS_SELCTRL) Packed data format -- left or right justified Mask */
#define SPI_IXS_SELCTRL_DATFMTLR(value)       (SPI_IXS_SELCTRL_DATFMTLR_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_DATFMTLR_Pos)) /* Assigment of value for DATFMTLR in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_TURSAMP_Pos           _UINT32_(23)                                         /* (SPI_IXS_SELCTRL) Transmit Under-run last sample sent Position */
#define SPI_IXS_SELCTRL_TURSAMP_Msk           (_UINT32_(0x1) << SPI_IXS_SELCTRL_TURSAMP_Pos)       /* (SPI_IXS_SELCTRL) Transmit Under-run last sample sent Mask */
#define SPI_IXS_SELCTRL_TURSAMP(value)        (SPI_IXS_SELCTRL_TURSAMP_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_TURSAMP_Pos)) /* Assigment of value for TURSAMP in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_DATFILL_Pos           _UINT32_(24)                                         /* (SPI_IXS_SELCTRL) DATFILL undefined bits 1 or 0 Position */
#define SPI_IXS_SELCTRL_DATFILL_Msk           (_UINT32_(0x1) << SPI_IXS_SELCTRL_DATFILL_Pos)       /* (SPI_IXS_SELCTRL) DATFILL undefined bits 1 or 0 Mask */
#define SPI_IXS_SELCTRL_DATFILL(value)        (SPI_IXS_SELCTRL_DATFILL_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_DATFILL_Pos)) /* Assigment of value for DATFILL in the SPI_IXS_SELCTRL register */
#define SPI_IXS_SELCTRL_MODEEN_Pos            _UINT32_(30)                                         /* (SPI_IXS_SELCTRL) MACRO MODE ENABLED Position */
#define SPI_IXS_SELCTRL_MODEEN_Msk            (_UINT32_(0x3) << SPI_IXS_SELCTRL_MODEEN_Pos)        /* (SPI_IXS_SELCTRL) MACRO MODE ENABLED Mask */
#define SPI_IXS_SELCTRL_MODEEN(value)         (SPI_IXS_SELCTRL_MODEEN_Msk & (_UINT32_(value) << SPI_IXS_SELCTRL_MODEEN_Pos)) /* Assigment of value for MODEEN in the SPI_IXS_SELCTRL register */
#define   SPI_IXS_SELCTRL_MODEEN_DFTLEN_Val   _UINT32_(0x0)                                        /* (SPI_IXS_SELCTRL) Default Mode  */
#define   SPI_IXS_SELCTRL_MODEEN_AUDEN_Val    _UINT32_(0x1)                                        /* (SPI_IXS_SELCTRL) Audio Mode  */
#define   SPI_IXS_SELCTRL_MODEEN_TDMEN_Val    _UINT32_(0x2)                                        /* (SPI_IXS_SELCTRL) Framed Mode  */
#define   SPI_IXS_SELCTRL_MODEEN_TPDEN_Val    _UINT32_(0x3)                                        /* (SPI_IXS_SELCTRL) Broadcast Mode  */
#define SPI_IXS_SELCTRL_MODEEN_DFTLEN         (SPI_IXS_SELCTRL_MODEEN_DFTLEN_Val << SPI_IXS_SELCTRL_MODEEN_Pos) /* (SPI_IXS_SELCTRL) Default Mode Position  */
#define SPI_IXS_SELCTRL_MODEEN_AUDEN          (SPI_IXS_SELCTRL_MODEEN_AUDEN_Val << SPI_IXS_SELCTRL_MODEEN_Pos) /* (SPI_IXS_SELCTRL) Audio Mode Position  */
#define SPI_IXS_SELCTRL_MODEEN_TDMEN          (SPI_IXS_SELCTRL_MODEEN_TDMEN_Val << SPI_IXS_SELCTRL_MODEEN_Pos) /* (SPI_IXS_SELCTRL) Framed Mode Position  */
#define SPI_IXS_SELCTRL_MODEEN_TPDEN          (SPI_IXS_SELCTRL_MODEEN_TPDEN_Val << SPI_IXS_SELCTRL_MODEEN_Pos) /* (SPI_IXS_SELCTRL) Broadcast Mode Position  */
#define SPI_IXS_SELCTRL_Msk                   _UINT32_(0xC1817C73)                                 /* (SPI_IXS_SELCTRL) Register Mask  */


/* -------- SPI_IXS_SPICTRL : (SPI_IXS Offset: 0x08) (R/W 32) SPI Control Register -------- */
#define SPI_IXS_SPICTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_SPICTRL) SPI Control Register  Reset Value */

#define SPI_IXS_SPICTRL_MODE_Pos              _UINT32_(0)                                          /* (SPI_IXS_SPICTRL) Serial Word Length bits for AUDEN=0, not used when AUDEN=1 Position */
#define SPI_IXS_SPICTRL_MODE_Msk              (_UINT32_(0x3) << SPI_IXS_SPICTRL_MODE_Pos)          /* (SPI_IXS_SPICTRL) Serial Word Length bits for AUDEN=0, not used when AUDEN=1 Mask */
#define SPI_IXS_SPICTRL_MODE(value)           (SPI_IXS_SPICTRL_MODE_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_MODE_Pos)) /* Assigment of value for MODE in the SPI_IXS_SPICTRL register */
#define   SPI_IXS_SPICTRL_MODE_MODE8_Val      _UINT32_(0x0)                                        /* (SPI_IXS_SPICTRL) 8 Bits Mode  */
#define   SPI_IXS_SPICTRL_MODE_MODE16_Val     _UINT32_(0x1)                                        /* (SPI_IXS_SPICTRL) 16 Bits Mode  */
#define   SPI_IXS_SPICTRL_MODE_MODE32_Val     _UINT32_(0x2)                                        /* (SPI_IXS_SPICTRL) 32 Bits Mode  */
#define SPI_IXS_SPICTRL_MODE_MODE8            (SPI_IXS_SPICTRL_MODE_MODE8_Val << SPI_IXS_SPICTRL_MODE_Pos) /* (SPI_IXS_SPICTRL) 8 Bits Mode Position  */
#define SPI_IXS_SPICTRL_MODE_MODE16           (SPI_IXS_SPICTRL_MODE_MODE16_Val << SPI_IXS_SPICTRL_MODE_Pos) /* (SPI_IXS_SPICTRL) 16 Bits Mode Position  */
#define SPI_IXS_SPICTRL_MODE_MODE32           (SPI_IXS_SPICTRL_MODE_MODE32_Val << SPI_IXS_SPICTRL_MODE_Pos) /* (SPI_IXS_SPICTRL) 32 Bits Mode Position  */
#define SPI_IXS_SPICTRL_DISSDI_Pos            _UINT32_(3)                                          /* (SPI_IXS_SPICTRL) Disable SDI bit Position */
#define SPI_IXS_SPICTRL_DISSDI_Msk            (_UINT32_(0x1) << SPI_IXS_SPICTRL_DISSDI_Pos)        /* (SPI_IXS_SPICTRL) Disable SDI bit Mask */
#define SPI_IXS_SPICTRL_DISSDI(value)         (SPI_IXS_SPICTRL_DISSDI_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_DISSDI_Pos)) /* Assigment of value for DISSDI in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_DISSDO_Pos            _UINT32_(4)                                          /* (SPI_IXS_SPICTRL) Disable SDO bit Position */
#define SPI_IXS_SPICTRL_DISSDO_Msk            (_UINT32_(0x1) << SPI_IXS_SPICTRL_DISSDO_Pos)        /* (SPI_IXS_SPICTRL) Disable SDO bit Mask */
#define SPI_IXS_SPICTRL_DISSDO(value)         (SPI_IXS_SPICTRL_DISSDO_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_DISSDO_Pos)) /* Assigment of value for DISSDO in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_MSTEN_Pos             _UINT32_(5)                                          /* (SPI_IXS_SPICTRL) Master Mode Enable bit Position */
#define SPI_IXS_SPICTRL_MSTEN_Msk             (_UINT32_(0x1) << SPI_IXS_SPICTRL_MSTEN_Pos)         /* (SPI_IXS_SPICTRL) Master Mode Enable bit Mask */
#define SPI_IXS_SPICTRL_MSTEN(value)          (SPI_IXS_SPICTRL_MSTEN_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_MSTEN_Pos)) /* Assigment of value for MSTEN in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_MSSEN_Pos             _UINT32_(6)                                          /* (SPI_IXS_SPICTRL) Master/Slave Mode Select Enable bit Position */
#define SPI_IXS_SPICTRL_MSSEN_Msk             (_UINT32_(0x1) << SPI_IXS_SPICTRL_MSSEN_Pos)         /* (SPI_IXS_SPICTRL) Master/Slave Mode Select Enable bit Mask */
#define SPI_IXS_SPICTRL_MSSEN(value)          (SPI_IXS_SPICTRL_MSSEN_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_MSSEN_Pos)) /* Assigment of value for MSSEN in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_SPISGNEXT_Pos         _UINT32_(9)                                          /* (SPI_IXS_SPICTRL) Sign Extend Read Data from the RX FIFO Position */
#define SPI_IXS_SPICTRL_SPISGNEXT_Msk         (_UINT32_(0x1) << SPI_IXS_SPICTRL_SPISGNEXT_Pos)     /* (SPI_IXS_SPICTRL) Sign Extend Read Data from the RX FIFO Mask */
#define SPI_IXS_SPICTRL_SPISGNEXT(value)      (SPI_IXS_SPICTRL_SPISGNEXT_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_SPISGNEXT_Pos)) /* Assigment of value for SPISGNEXT in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_SMP_Pos               _UINT32_(10)                                         /* (SPI_IXS_SPICTRL) SPI Data Input Sample Phase bit Position */
#define SPI_IXS_SPICTRL_SMP_Msk               (_UINT32_(0x1) << SPI_IXS_SPICTRL_SMP_Pos)           /* (SPI_IXS_SPICTRL) SPI Data Input Sample Phase bit Mask */
#define SPI_IXS_SPICTRL_SMP(value)            (SPI_IXS_SPICTRL_SMP_Msk & (_UINT32_(value) << SPI_IXS_SPICTRL_SMP_Pos)) /* Assigment of value for SMP in the SPI_IXS_SPICTRL register */
#define SPI_IXS_SPICTRL_Msk                   _UINT32_(0x0000067B)                                 /* (SPI_IXS_SPICTRL) Register Mask  */


/* -------- SPI_IXS_FRAMECTRL : (SPI_IXS Offset: 0x0C) (R/W 32) SPI Control Frame Register -------- */
#define SPI_IXS_FRAMECTRL_RESETVALUE          _UINT32_(0x00)                                       /*  (SPI_IXS_FRAMECTRL) SPI Control Frame Register  Reset Value */

